IOsonata/IOsonata/ARM/Nordic/nRF52/nRF52832/exemples/LvglDualDIsplayDemo/src/board.h
/**-------------------------------------------------------------------------
@file	board.h

@brief	Board specific definitions

This file contains all I/O definitions for a specific board for the
application firmware.  This files should be located in each project and
modified to suit the need for the application use case.

@author	Hoang Nguyen Hoan
@date	Nov. 16, 2016

@license

Copyright (c) 2016, I-SYST inc., all rights reserved

Permission to use, copy, modify, and distribute this software for any purpose
with or without fee is hereby granted, provided that the above copyright
notice and this permission notice appear in all copies, and none of the
names : I-SYST or its contributors may be used to endorse or
promote products derived from this software without specific prior written
permission.

For info or contributing contact : hnhoan at i-syst dot com

THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND ANY
EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE FOR ANY
DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

----------------------------------------------------------------------------*/
#ifndef __BOARD_H__
#define __BOARD_H__

#include "nrf.h"

// I-SYST IBK-NRF52840 board

#define BUT1_PORT						0
#define BUT1_PIN						13
#define BUT1_PINOP						0

#define BUT2_PORT						0
#define BUT2_PIN						4
#define BUT2_PINOP						0

#define BUT_PINS	{ \
	{BUT1_PORT, BUT1_PIN, BUT1_PINOP, IOPINDIR_INPUT, IOPINRES_PULLUP, IOPINTYPE_NORMAL},\
	{BUT2_PORT, BUT2_PIN, BUT2_PINOP, IOPINDIR_INPUT, IOPINRES_PULLUP, IOPINTYPE_NORMAL},\
}

#define SPI_DEVNO      					0
#define SPI_PHY							SPIPHY_NORMAL
#define SPI_RATE						8000000

#define SPI_MISO_PORT       			0
#define SPI_MISO_PIN        			19
#define SPI_MISO_PINOP      			1
#define SPI_MOSI_PORT       			0
#define SPI_MOSI_PIN        			20
#define SPI_MOSI_PINOP      			1
#define SPI_SCK_PORT        			0
#define SPI_SCK_PIN         			18
#define SPI_SCK_PINOP       			1

#define TFT_CS_PORT          			0
#define TFT_CS_PIN           			24
#define TFT_CS_PINOP         			0

#define TFT_DC_PORT            			0
#define TFT_DC_PIN             			23
#define TFT_DC_PINOP           			0

#define TFT_RST_PORT            		0
#define TFT_RST_PIN             		22
#define TFT_RST_PINOP           		0

#define TFT_BKLIGHT_PORT            	0
#define TFT_BKLIGHT_PIN             	25
#define TFT_BKLIGHT_PINOP           	0

#define TFT_CS2_PORT          			0
#define TFT_CS2_PIN           			5
#define TFT_CS2_PINOP         			0

#define TFT_DC2_PORT           			0
#define TFT_DC2_PIN            			4
#define TFT_DC2_PINOP          			0

#define TFT_BKLIGHT2_PORT            	0
#define TFT_BKLIGHT2_PIN             	6
#define TFT_BKLIGHT2_PINOP           	0

#define SPI_PINS	{ \
	{SPI_SCK_PORT, SPI_SCK_PIN, SPI_SCK_PINOP, IOPINDIR_OUTPUT, IOPINRES_NONE, IOPINTYPE_NORMAL}, \
    {SPI_MISO_PORT, SPI_MISO_PIN, SPI_MISO_PINOP, IOPINDIR_INPUT, IOPINRES_NONE, IOPINTYPE_NORMAL}, \
    {SPI_MOSI_PORT, SPI_MOSI_PIN, SPI_MOSI_PINOP, IOPINDIR_OUTPUT, IOPINRES_NONE, IOPINTYPE_NORMAL}, \
	{TFT_CS_PORT, TFT_CS_PIN, TFT_CS_PINOP, IOPINDIR_OUTPUT, IOPINRES_PULLUP, IOPINTYPE_NORMAL}, \
	{TFT_CS2_PORT, TFT_CS2_PIN, TFT_CS2_PINOP, IOPINDIR_OUTPUT, IOPINRES_PULLUP, IOPINTYPE_NORMAL}, \
}

#define TFT_PINS { \
	{TFT_DC_PORT, TFT_DC_PIN, TFT_DC_PINOP, IOPINDIR_OUTPUT, IOPINRES_NONE, IOPINTYPE_NORMAL}, \
	{TFT_BKLIGHT_PORT, TFT_BKLIGHT_PIN, TFT_BKLIGHT_PINOP, IOPINDIR_OUTPUT, IOPINRES_NONE, IOPINTYPE_NORMAL}, \
	{TFT_RST_PORT, TFT_RST_PIN, TFT_RST_PINOP, IOPINDIR_OUTPUT, IOPINRES_NONE, IOPINTYPE_NORMAL}, \
}

#define TFT2_PINS { \
	{TFT_DC2_PORT, TFT_DC2_PIN, TFT_DC2_PINOP, IOPINDIR_OUTPUT, IOPINRES_NONE, IOPINTYPE_NORMAL}, \
	{TFT_BKLIGHT2_PORT, TFT_BKLIGHT2_PIN, TFT_BKLIGHT_PINOP, IOPINDIR_OUTPUT, IOPINRES_NONE, IOPINTYPE_NORMAL}, \
}

#define LVBUFF_SIZE		(10*1024)

#endif // __BOARD_H__

